Revit 2024 API
UIMacroManager.GetMacroManager Method (UIApplication)
 Gets the UI Macro manager from the UI application.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static UIMacroManager GetMacroManager(
	UIApplication application
)
Visual Basic
Public Shared Function GetMacroManager ( _
	application As UIApplication _
) As UIMacroManager
Visual C++
public:
static UIMacroManager^ GetMacroManager(
	UIApplication^ application
)
Parameters
application
Type: Autodesk.Revit.UI.UIApplication
 The UI application.
Return Value
 The new UI Macro manager object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UIMacroManager Class
GetMacroManager Overload
Autodesk.Revit.UI.Macros Namespace